{
    "menu": {
        "SobreMi": "About me",
        "estudis": "Studies",
        "exp": "Work experience",
        "projectes": "Projects"
    },
    "sobreMiSeccio": {
        "desc": "I am a full stack developer with some systems knowledge. Currently, I find myself working on a large project with a company (Covercar), where I apply my skills to design and develop software to manage all departments of the company.",
        "desc2": "My long-term vision is to build my own business path, as I have in mind set up my own company to create applications for third parties. Right now I am focused on gaining the experience and knowledge necessary to make this goal a reality in the distant future.",
        "botCat": "Download Catalan CV",
        "botEsp": "Download Spanish CV",
        "contacte": "Contact",
        "enll": "Link from my LinkedIn"
    },
    "estudisSeccio":{
        "titol": "Studies",
        "ceti": "Cybersecurity in Information Technology Environments, <b>specialization course</b>.<br>Institut Lacetània, Manresa.",
        "dam": "Development of cross-platform applications, <b>Higher Degree training course</b>.<br>IES Castellet de Sant Viçens.",
        "smix":"Microcomputer systems and networks, <b>Intermediate training cycle</b>.<br>Escola Xarxa de Berga."
    },
    "expSeccio": {
        "titol": "Work experience",
        "fubTitol": "<b>Internship at FUB Manresa - UManresa</b>",
        "adfTitol": "<b>Internship at the Secretariat of ADF Federations in Catalonia</b>",
        "arxiuTitol": "<b>Internship at the Berga regional archive</b>",
        "coverTitol": "<b>Full Stack Developer - Covercar S.A </b>",
        "fub": "In the practices of the cyber security course I carried out a pentesting at the FUB in Manresa.",
        "adf": "In these practices, I transferred a database with Access, to MySQL. I also created a website using Laravel 8 to manage it.",
        "arxiu": "At this center I basically helped with system maintenance and performed office automation tasks.",
        "covercar": "In this company I am working full-time as a full-stack programmer. I use Angular for the frontend, Symfony for the backend and Mysql for the database.",
        "act": "Present"
    },
    "projectesSeccio": {
        "titolLar": "<b>Laravel Projects: </b>",
        "titolAn": "<b>Angular projects: </b>",
        "titolPy": "<b>Python projects: </b>",
        "titolAltres": "<b>Other projects: </b>",
        
        "titolFut": "Football players database",
        "titolFinal": "Final project of DAM course",
        "titolAnime": "Anime characters",
        "titolXat": "Group chat",
        "titolBot": "Telegram bot",
        "titolCalc": "Budget calculator",
        "titolBiblio": "Web library",

        "fut": "This website is created with Laravel and a MySQL database. Basically, it allows us to add soccer players to a database and query those soccer players.",
        "final": "In my end-of-year project, I made a website created with Laravel 8 and a database with MySQL. This website is made to upload my game and app projects, and registered users to download and rate them. There is also a section where you can find applications generated by other people.",
        "spoti": "A website created with Angular, in which I use the Spotify API to be able to search for artists and songs.",
        "anime": "Project created with Angular where you can consult characters from the anime One Piece.",
        "asteroids": "Python game where you have to destroy and dodge steroids.",
        "xat": "Group chat created with Python, in which there is a server and you can open all the chats you want. The server notifies you when someone new connects and when people disconnect.",
        "bot": "Telegram bot programmed with Python and a SQLite database. In this bot you can play very simple mini-games, but before doing so you have to register.",
        "calc": "In this project, I have created a program to calculate expenses (with TypeScript). I used as a template for the design and programmed the various functions to make the calculator work properly.",
        "biblio": "Web project created with PHP and MariaDB. It is a website where you have a section of books, where you can manage them from the administrator's page.",
        
        "titolBotiga": "Online shop",
        "botiga": "Project created with Angular 12 for the frontend and I use the json-server dependency for the backend (in the future I plan to implement it with Node). This website simulates the page of a company, where you have several products and you can buy them from the same website. No payment method is currently implemented, so customers should pay in person.",
        
        "titolGesEmpleats": "Employee management",
        "gesEmpleats": "This website is developed with Laravel 8 and a MySQL database. It includes a login page, since in order to access employee management you must register or log in with your user. Once logged in, you have a Crud to be able to manage your company's employees. It's an active project and features are still being added.",

        "but": "View code"
    },
    "footer":{
        "text":"Website developed by Joan Planas"
    }
}